backend/controllers/AssignmentController.php

SELECT * FROM `Assignment` WHERE `AssignmentID`='1'
---
    protected function findModel($AssignmentID)
    {
        if (($model = Assignment::findOne(['AssignmentID' => $AssignmentID])) !== null) {