frontend/views/student/profile.php

$this->params['breadcrumbs'][] = ['label' => Yii::t('app', 'Students'), 'url' => ['profile']];
$this->params['breadcrumbs'][] = $this->title;

$courses = Course::find()->select(['courseCode','courseName'])->indexBy('courseCode')->column();
$programme = \frontend\models\Programme::find()->all();//->select(['programmeCode'])->indexBy('programmeCode')->column();
---
SELECT `courseCode`, `courseName` FROM `Course`
SELECT `programmeCode`, `Programme`.`programmeCode` FROM `Programme`