frontend/controllers/InstructorController.php

    public function actionProfile()
    {
        // Check if an instructor record already exists for the current user
    //$existingInstructor = Instructor::findOne(['UserID' => Yii::$app->user->identity->id]);
    $existingInstructor = Instructor::find()
    ->joinWith('user')
    ->where([
        'Instructor.UserID' => Yii::$app->user->identity->id,
        'User.role' => 'instructor', // Assuming the column name is 'role' in the user table
    ])
    ->one();


    // If an instructor record already exists, redirect to the view action
    if ($existingInstructor !== null) {
        return $this->redirect(['view', 'InstructorID' => $existingInstructor->InstructorID]);
    }

        $instructor = new Instructor();
        $instructor->UserID = Yii::$app->user->identity->id;
        if ($this->request->isPost) {
            if ($instructor->load($this->request->post()) && $instructor->save()) {
---
SELECT `Instructor`.* FROM `Instructor` LEFT JOIN `User` ON `Instructor`.`UserID` = `User`.`UserID` WHERE (`Instructor`.`UserID`=3) AND (`User`.`role`='instructor')
SELECT * FROM `User` WHERE `UserID`=3

    protected function findModel($InstructorID)
    {
        if (($model = Instructor::findOne(['InstructorID' => $InstructorID])) !== null) {
---
SELECT * FROM `Instructor` WHERE `InstructorID`='1'