frontend/controllers/StudentController.php

SELECT `Student`.* FROM `Student` LEFT JOIN `User` ON `Student`.`userID` = `User`.`UserID` WHERE (`Student`.`userID`=3) AND (`User`.`role`='student')
SELECT * FROM `User` WHERE `UserID`=1
---
    public function actionProfile()
    {

        $existingStudent = Student::find()
        ->joinWith('user')
        ->where([
            'Student.userID' => Yii::$app->user->identity->id,
            'User.role' => 'student', // Assuming the column name is 'role' in the user table
        ])
        ->one();
        if($existingStudent !== null){
            return $this->redirect(['view', 'StudentID' => $existingStudent->StudentID]);

        }

        $Student = new Student();
        $Student->userID = Yii::$app->user->identity->id;

        if ($this->request->isPost) {
            $Student->load($this->request->post());

SELECT * FROM `Student` WHERE `StudentID`='12'
---
    protected function findModel($StudentID)
    {
        if (($model = Student::findOne(['StudentID' => $StudentID])) !== null) {