backend/views/group/index.php

    <?php Pjax::begin(); ?>
    <?php // echo $this->render('_search', ['model' => $searchModel]); ?>

    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
            ['class' => 'yii\grid\SerialColumn'],

            'groupID',
            'groupNo',
            'courseCode',
            'groupName',
            [
                'class' => ActionColumn::className(),
                'urlCreator' => function ($action, Group $model, $key, $index, $column) {
                    return Url::toRoute([$action, 'groupID' => $model->groupID]);
                 }
            ],
        ],
    ]); ?>
---
SELECT * FROM `Group` LIMIT 20
SELECT COUNT(*) FROM `Group`