backend/views/course/index.php

SELECT * FROM `Course` LIMIT 20
SELECT COUNT(*) FROM `Course`
---
    <?php Pjax::begin(); ?>
    <?php // echo $this->render('_search', ['model' => $searchModel]); ?>

    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
            ['class' => 'yii\grid\SerialColumn'],

            'courseName',
           // 'courseCode',
            //'semester',
           // 'year',
            [
                'attribute'=> 'Course Instructor',
                'format'=> 'text',
                'value'=> function ($model){
                    $instructor = \backend\models\Instructor::findOne(['InstructorID' => $model->courseInstructor]);
                    if($instructor){
                        return $instructor->fname. ' ' .$instructor->lname;
                    }
                }
            ],
            'programmeCode',