frontend/views/layouts/StudentSideNav.php

SELECT * FROM `Student` WHERE `userID`=1
---
    <?php
    use kartik\sidenav\SideNav;
    use yii\helpers\Html;
    $student = frontend\models\Student::findOne(['userID' => Yii::$app->user->identity->getId()]);