backend/models/Admin.php

SELECT * FROM `Admin` WHERE (`id`=4) AND (`status`=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);