frontend/views/assignment/index.php


</div>
    <?php Pjax::begin(); ?>
    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
            ['class' => 'yii\grid\SerialColumn'],

            //'AssignmentID',
            [
                'attribute' => 'Course Name',
                'value' => function ($model) {
                    return frontend\models\Course::find()->where(['courseCode' => $model->courseCode])->one()->courseName; // Assuming group_name is the attribute you want to display
                },
            ],
            'courseCode',
            'assignment',
            'title',
           // 'content:ntext',
           // 'description:html',
            //'fileURL',
            'assignedDate',
            'submissionDate',
            'marks',
---
SELECT COUNT(*) FROM `Assignment`