frontend/models/User.php

SELECT * FROM `User` WHERE (`UserID`=1) AND (`status`=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['UserID' => $id, 'status' => self::STATUS_ACTIVE]);