frontend/models/User.php

    public static function findIdentity($id)
    {
        return static::findOne(['UserID' => $id, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `User` WHERE (`UserID`=3) AND (`status`=10)